Table of Contents
 Class ResultOfInternalForces2
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Result of internal forces in the one position
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfInternalForces2 : ResultOfLoading2
Inheritance
object
ResultOfLoading2
ResultOfInternalForces2
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ResultOfInternalForces2()
Constructor
public ResultOfInternalForces2()
Properties
 Loading
LoadingTypeClass
public Loading Loading { get; set; }
Property Value
Loading
 Mx
Bending moment around x-axis
public double Mx { get; set; }
Property Value
double
 My
Bending moment around y-axis
public double My { get; set; }
Property Value
double
 Mz
Bending moment around z-axis
public double Mz { get; set; }
Property Value
double
 N
Normal force
public double N { get; set; }
Property Value
double
 Qy
Shear force in y dirrection
public double Qy { get; set; }
Property Value
double
 Qz
Shear force in z dirrection
public double Qz { get; set; }
Property Value
double
 Edit this page